---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ParameterUtils
source: html/415f10ef-2fa5-a9e1-e5b0-7ae243e3748a.htm
---
# ParameterUtils Members

Downloads the name of the given parameter's owning account and records it in the given document. If the owning
 account's name is already recorded in the given document, this method returns the name without downloading it
 again.